Revit 2027 API
FabricationNetworkChangeService.SetPartTypesforMapping Method
 Set a map of element identifiers of fabrication part types that will be mapped when the change service is applied. When part types in the map are encountered, they will be updated to the associated map component. This overrides the default parts that can be used by route and fill solutions driven by the fabrication configuration and service. Set the fabrication part types for parts for the service and palette to map too.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPartTypesforMapping(
	IDictionary<ElementId, ElementId> fabricationPartTypes
)
Public Sub SetPartTypesforMapping (
	fabricationPartTypes As IDictionary(Of ElementId, ElementId)
)
public:
void SetPartTypesforMapping(
	IDictionary<ElementId^, ElementId^>^ fabricationPartTypes
)
member SetPartTypesforMapping :
        fabricationPartTypes : IDictionary<ElementId, ElementId> -> unit
Parameters
fabricationPartTypes IDictionary<ElementId, ElementId>
 The map containing the original fabrication part type to the mapped fabrication part type to change to.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 After this method has been invoked, call:
SetPartTypeMappingState(Boolean) to enable or disable the use of the part type mappings when the change service is applied.
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace